// использование переменных

/* Для того чтобы использовать переменную, её сначала необходимо 
объявить: написать перед её именем ключевое слово let */

// объявляем переменную с именем a
let a;

/* После объявления переменной в неё можно записать (присвоить) 
какое-либо значение, например, какое-либо число или строку. */

/* Запись данных в переменную осуществляется с помощью операции
присваивания =. 
Давайте, например, запишем в переменную а1 число 3 */

let a1 = 3; // объявили переменную и задали ей значение
console.log(a1); // выведет на экран 3

/* Не обязательно записывать значение в переменную 
сразу после объявление. Можно сначала объявить переменную, а
потом присвоить значение  */
a = 3;

/* Как видите, let перед именем переменной пишется только один раз -
при объявлении этой переменной. Затем, чтобы использовать переменную, нужно 
просто написать имя переменной */

/* Задача 1

Создайте переменную num и присвойте ей значение 123. 

Выведите значение этой переменной на экран с помощью функции alert.
*/

let num = 123;
// выведем в консоль, вместо браузера, так захотелось
console.log(num);
