// №1⊗jsPmBsMOV
// Создайте переменную a со значением 10
// и переменную b со значением 2.
// Выведите на экран их сумму, разность, произведение
// и частное (результат деления).
console.log("Задача 1");
let a = 10;
let b = 2;
console.log(`Сумма ${a} и ${b} равна ${a + b}`);
console.log(`Разность ${a} и ${b} равна ${a - b}`);
console.log(`Произведение ${a} и ${b} равно ${a * b}`);
console.log(`Частное ${a} и ${b} равно ${a / b}`);

// №2⊗jsPmBsMOV
// Создайте переменную c со значением 10 и
// переменную d со значением 5.
// Просуммируйте их, а результат присвойте переменной
// result. Выведите на экран значение переменной result.
console.log("\nЗадача 2");
let d = 5;
let c = 10;
let result = d + c;
console.log(result);

// №3⊗jsPmBsMOV
// Создайте переменную a со значением 1,
//  переменную b со значением 2 и переменную
// c со значением 3. Выведите на экран их сумму.
console.log("\nЗадача 3");
a = 1;
b = 2;
c = 3;
console.log(a + b + c);

// №4⊗jsPmBsMOV
// Создайте переменную a со значением 10
// и переменную b со значением 5.
//  Отнимите от a переменную b и результат
// присвойте переменной c.
// Затем создайте переменную d,
//  присвойте ей значение 7.
// Сложите переменные c и d,
// а результат запишите в переменную result.
//  Выведите на экран значение переменной result.
console.log("\nЗадача 4");
a = 10;
b = 5;
c = a - b; // 5
d = 7;
result = c + d;
console.log(result);
