// №1
// Не запуская код, определите, что выведется на экран:
let a = (2 + 3) * (2 + 3);
console.log(a); // 25

// №2
// Не запуская код, определите, что выведется на экран:
a = (2 + 3) * 2 + 3;
console.log(a); // 13

// №3
// Не запуская код, определите, что выведется на экран:
a = 2 * (2 + 4 * (3 + 1));
console.log(a); // 36

// №4
// Не запуская код, определите, что выведется на экран:
a = (2 * 8) / 4;
console.log(a); // 4

// №5
// Не запуская код, определите, что выведется на экран:
a = (2 * 8) / 4;
console.log(a); // 4

// №6
// Не запуская код, определите, что выведется на экран:
a = 2 * (8 / 4);
console.log(a); // 4
