// №1⊗jsPmBsNPr

// Не запуская код, определите,
// что выведется на экран:
let a = 3 * 2 ** 3; // 24
console.log(a); // 24

// №2⊗jsPmBsNPr

// Не запуская код, определите, что выведется на экран:
a = (3 * 2) ** 3; // 6* 36 = 216
console.log(a);

// №3⊗jsPmBsNPr
// Не запуская код, определите, что выведется на экран:
a = 3 * 2 ** (3 + 1); // 3 * 16 = 48
console.log(a);

// №4⊗jsPmBsNPr
// Не запуская код, определите, что выведется на экран:
a = 2 ** 3 * 3;
console.log(a); // 24

// №5⊗jsPmBsNPr
// Не запуская код, определите, что выведется на экран:
a = 3 * 2 ** 3 * 3; // 3 * 8 * 3 = 72
console.log(a);
