// №1
// Не запуская код, определите,
// что выведется на экран:
let a = "5" + "2";
console.log(a); // 52

// №2
// Не запуская код, определите, что выведется на экран:
a = "5" + 2;
console.log(a); // 52

// №3
// Не запуская код, определите, что выведется на экран:
a = 5 + "2";
console.log(a); // 52

// №4
// Не запуская код, определите, что выведется на экран:
a = 5 + 2;
console.log(a); // 7

// №5
// Не запуская код, определите, что выведется на экран:
a = "5" * "2";
console.log(a); // 10

// №6
// Не запуская код, определите, что выведется на экран:
a = "5" - "2";
console.log(a); // 3

// №7
// Не запуская код, определите, что выведется на экран:
a = "5" / "2";
console.log(a); // 2.5

// №8
// Не запуская код, определите, что выведется на экран:
a = "5" % "2";
console.log(a); // 1

// №9
// Не запуская код, определите, что выведется на экран:
a = "5s" * "2";
console.log(a); // NaN

// №10
// Не запуская код, определите, что выведется на экран:
a = "5s" + "2";
console.log(a); // 5s2

// №11
// Не запуская код, определите, что выведется на экран:
a = -"5" + -"2";
console.log(a); // -7

// №12
// Не запуская код, определите, что выведется на экран:
a = "5" * 1 + "2" * 1;
console.log(a); // 5 + 2 = 7

// №13
// Не запуская код, определите, что выведется на экран:
a = "5" * "1" + "2" * "1";
console.log(a); // 7

// №14
// Не запуская код, определите, что выведется на экран:
a = "" + 3 + 1;
console.log(a); // 31
