console.log(0.1 + 0.2); // 0.30000000000000004

// метод toFixed выполняет округление до заданного знака в дробной части

console.log((0.1 + 0.2).toFixed(2)); // 0.30

// метод toFixed отдаёт результат в виде строки

console.log(typeof (0.1 + 0.2).toFixed(2)); // string
console.log(typeof +(0.1 + 0.2).toFixed(2)); // string

// Проверьте, что будет результатом следующей операции:

console.log(0.1 * 0.2); // 0.020000000000000004

// №2⊗jsPmBsIC
// Проверьте, что будет результатом следующей операции:

console.log(0.3 - 0.1); // 0.19999999999999998
