// №1⊗jsPmBsPrmO
// Найдите количество секунд в сутках.
const secondsInDay = 24 * 60 * 60;
console.log(`Секунд в сутках: ${secondsInDay}`);

// №2⊗jsPmBsPrmO
// Найдите количество секунд в 30 сутках.
console.log(`Секунд в 30 сутках: ${secondsInDay * 30}`);

// №3⊗jsPmBsPrmO
// Найдите количество секунд в году.
console.log(`Секунд в году: ${secondsInDay * 365}`);

// №4⊗jsPmBsPrmO
// Найдите количество минут в сутках.
const minutesInDay = 24 * 60;
console.log(`Минут в сутках: ${minutesInDay}`);

// №5⊗jsPmBsPrmO
// Найдите количество минут в году.
console.log(`Минут в году: ${minutesInDay * 365}`);

// №6⊗jsPmBsPrmO
// Найдите количество байт в мегабайте.
console.log(`Байт в мегабайте: ${2 ** 20}`);

// №7⊗jsPmBsPrmO
// Найдите количество байт в гигабайте.
console.log(`Байт в гигабайте: ${2 ** 30}`);

// №8⊗jsPmBsPrmO
// Найдите количество байт в 10 гигабайтах.
console.log(`Байт в 10 гигабайтах: ${2 ** 30 * 10}`);

// №9⊗jsPmBsPrmO
// Найдите количество байт в терабайте.
console.log(`Байт в терабайте: ${2 ** 40}`);

// №10⊗jsPmBsPrmO
// Найдите количество килобайт в терабайте.
// 1 кб - 1024 байт
console.log(`Килобайт в терабайте: ${2 ** 30}`);
