// №1⊗jsPmBsPrmF
// Пусть дана переменная r с радиусом круга.
// По соответствующей формуле найдите площадь круга и
// запишите ее в переменную s.
// Выведите содержимое этой переменной на экран.

let r = 12;
let s = Math.PI * r ** 2;
console.log(s);

// №2⊗jsPmBsPrmF
// Пусть дана переменная a со стороной квадрата.
//  Найдите площадь квадрата и запишите ее в переменную
// s. Выведите содержимое этой переменной на экран.

let a = 12;
s = a ** 2;
console.log(s);

// №3⊗jsPmBsPrmF
// Пусть даны переменные a и b со сторонами
// прямоугольника. Найдите площадь прямоугольника
// и запишите ее в переменную s.
// Выведите содержимое этой переменной на экран.

a = 12;
let b = 32;
console.log(a * b);

// №4⊗jsPmBsPrmF
// Пусть даны переменные a и b со сторонами
//  прямоугольника. Найдите периметр
// прямоугольника и запишите его в переменную p.
// Выведите содержимое этой переменной на экран.
let p = (a + b) * 2;
console.log(p);

// №5⊗jsPmBsPrmF
// Пусть дана переменная tc с температурой в градусах
//  Цельсия. По соответствующей формуле выполните
//  перевод этой температуры в градусы Фаренгейта.
let tc = 32;
let tf = (tc * 9) / 5 + 32;
console.log(tf);

// №6⊗jsPmBsPrmF
// Пусть дана переменная tf с температурой в
// градусах Фаренгейта.
// По соответствующей формуле выполните
// перевод этой температуры в градусы Цельсия.
tf = 32;
tc = ((tf - 32) * 5) / 9;
console.log(tc);
