// №1⊗jsPmSMMA
// Даны переменные test1 и test2.
// Проверьте, что значение какой из этих переменных
// больше и выведите соответствующее сообщение.

let test1 = 25;
let test2 = 34;

if (test1 > test2) {
  console.log("Переменная test1 больше");
} else {
  console.log("Переменная test2 больше");
}

// №2⊗jsPmSMMA
// Даны переменные test1 и test2.
// Проверьте, равны ли их значения и выведите
// соответствующее сообщение.

if (test1 == test2) {
  console.log("Переменные равны");
} else {
  console.log("Переменные не равны");
}
