// №1⊗jsPmSMMA
// Проверьте, что переменная num больше нуля и
// меньше 5.

let num = 3;
if (num > 0 && num < 5) {
  console.log("переменная num больше нуля и меньше 5.");
} else {
  console.log("переменная num не больше нуля и меньше 5.");
}

// №2⊗jsPmSMMA
// Проверьте, что переменная num больше или равна 10
// и меньше или равна 20.

if (num >= 10 && num <= 20) {
  console.log("num больше или равна 10 и меньше или равна 20.");
} else {
  console.log("num не больше или равна 10 и меньше или равна 20.");
}

// №3⊗jsPmSMMA
// Проверьте, что переменная num1 равна или меньше 1,
//  а переменная num2 больше или равна 3.

let num1 = 1;
let num2 = 3;

if (num1 <= 1 && num2 >= 3) {
  console.log(
    "переменная num1 равна или меньше 1, а переменная num2 больше или равна 3."
  );
} else {
  console.log(
    "переменная num1 не равна или меньше 1, а переменная num2 больше или равна 3."
  );
}
