console.log("Задача 1");
// Не запуская код определите,
// что выведется в консоль:
let num1 = -10;
let num2 = -10;

if (num1 >= 0 || num2 >= 0) {
  console.log("+++");
} else {
  console.log("Выведется это, потому что оба условия - false");
}

console.log("Задача 2");
// Не запуская код определите,
// что выведется в консоль:
num1 = 0;
num2 = 0;
if (num1 >= 0 || num2 >= 0) {
  console.log("Выведется это, потому что оба условия верны!");
} else {
  console.log("---");
}

console.log("Задача 3");
// Не запуская код определите, что выведется в консоль:
num1 = 0;
num2 = 5;
if (num1 >= 0 || num2 >= 0) {
  console.log("Оба условия верны");
} else {
  console.log("---");
}

console.log("Задача 4");
// Не запуская код определите, что выведется в консоль:
num1 = 5;
num2 = 5;
if (num1 >= 0 || num2 >= 0) {
  console.log("Оба условия верны");
} else {
  console.log("---");
}

console.log("Задача 5");
// Не запуская код определите, что выведется в консоль:

num1 = -5;
num2 = 15;

if (num1 >= 0 || num2 >= 0) {
  console.log("второе условие верное");
} else {
  console.log("---");
}

console.log("Задача 6");
// Не запуская код определите, что выведется в консоль:

num = 1;

if (num == 0 || num == 1) {
  console.log("второе условие верное");
} else {
  console.log("---");
}

console.log("Задача 7");
// Не запуская код определите, что выведется в консоль:

num = 2;

if (num == 0 || num == 1) {
  console.log("+++");
} else {
  console.log("ни одно из условий не верно");
}

console.log("Задача 8");
// Не запуская код определите, что выведется в консоль:

num = 2;

if (num == 0 || num == 1 || num == 2) {
  console.log("третье условие верное");
} else {
  console.log("---");
}
