// №1⊗jsPmSMMA
// Пусть даны следующие переменные:
let a = 2 * (3 - 1);
let b = 6 - 2;
// Используя оператор ==, узнайте, равны ли
// значения этих переменных или нет.
console.log("task 1");
console.log(a == b);

// №2⊗jsPmSMMA
// Пусть даны следующие переменные:
a = 5 * (7 - 4);
b = 1 + 2 + 7;
// Используя оператор >, узнайте, больше ли переменная a, чем b.
console.log("task 2");
console.log(a > b);

// №3⊗jsPmSMMA
// Пусть даны следующие переменные:
a = 2 ** 4;
b = 4 ** 2;
// Используя операцию оператор !=, узнайте, разные ли значения этих переменных или нет.
console.log("task 3");
console.log(a != b);
