// №1⊗jsPmMuAF
// Сформируйте с помощью двух вложенных циклов следующий массив:

// [[1, 2, 3, 4, 5], [1, 2, 3, 4, 5],
// 	[1, 2, 3, 4, 5]]

console.log("task 1");
let arr1 = [];

for (let i = 0; i < 3; i++) {
  arr1[i] = []; // создаём подмассив
  for (let j = 1; j <= 5; j++) {
    arr1[i].push(j); // заполняем подмассив числами
  }
}
console.log(arr1);

// №2⊗jsPmMuAF
// Сформируйте с помощью двух вложенных циклов следующий массив:

// [
// 	['x', 'x', 'x', 'x'],
// 	['x', 'x', 'x', 'x'],
// 	['x', 'x', 'x', 'x']
// ]

console.log("task 2");
let arr2 = [];
for (let i = 0; i < 3; i++) {
  arr2[i] = [];
  for (let j = 0; j < 4; j++) {
    arr2[i].push("x");
  }
}
console.log(arr2);

// №3⊗jsPmMuAF
// Сформируйте с помощью трех вложенных циклов следующий массив:
console.log("task 3");
// [
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// ]
let arr3 = [];
for (let i = 0; i < 3; i++) {
  arr3[i] = [];
  for (let j = 0; j < 2; j++) {
    arr3[i][j] = [];
    for (let k = 0, m = 1; k < 5; k++, m++) {
      arr3[i][j][k] = m;
    }
  }
}
console.log(arr3);
