// №1⊗jsPmMuAFP
// Автор следующего кода хотел сделать двухмерный массив:
console.log("task 1");
let arr = [];

for (let i = 0; i < 3; i++) {
  arr[i] = [];
  for (let j = 1; j <= 5; j++) {
    arr[i].push(j);
  }
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// №2⊗jsPmMuAFP
// Автор следующего кода хотел сделать двухмерный массив:
console.log("task 2");
arr = [];

for (let i = 0; i < 3; i++) {
  arr[i] = [];

  for (let j = 1; j <= 5; j++) {
    arr[i].push(j);
  }
}

console.log(arr);

// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.
// №3⊗jsPmMuAFP
console.log("task 3");
// Автор следующего кода хотел сделать двухмерный массив:

arr = [];

for (let i = 0; i < 3; i++) {
  arr[i] = [];

  for (let j = 1; j <= 5; j++) {
    arr[i].push(j);
  }
}
console.log(arr);

// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.
// №4⊗jsPmMuAFP
// Автор следующего кода хотел сделать двухмерный массив:
console.log("task 4");
arr = [];

for (let i = 0; i < 3; i++) {
  arr[i] = [];

  for (let j = 1; j <= 5; j++) {
    arr[i].push(j);
  }
}

console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.
// №5⊗jsPmMuAFP
// Автор следующего кода хотел сделать двухмерный массив:
console.log("TASK 5");
arr = [];

for (let i = 0; i < 3; i++) {
  arr[i] = [];

  for (let j = 1; j <= 5; j++) {
    arr[i].push(j);
  }
}
console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// №6⊗jsPmMuAFP
// Автор следующего кода хотел сделать двухмерный массив:
console.log("task 6");
arr = [];

for (let i = 0; i < 3; i++) {
  arr[i] = [];

  for (let j = 1; j <= 5; j++) {
    arr[i].push(j);
  }
}
console.log(arr);
