// №1⊗jsPmFTFVA
// Сделайте безымянную функцию,
// которая будет возвращать через return число 1.
//  Запишите эту функцию в переменную func1.
let func1 = function () {
  return 1;
};
// №2⊗jsPmFTFVA
// Сделайте безымянную функцию, которая будет
// возвращать через return число 2.
// Запишите эту функцию в переменную func2.
let func2 = function () {
  return 2;
};
// №3⊗jsPmFTFVA
// Найдите сумму значений функций func1 и func2.
// Выведите эту сумму алертом в консоль.
console.log(func1() + func2()); // 3
